{
  "about-title": "About Us",
  "who": "WHO WE ARE",
  "who-text-1": "Property Invest USA specializes in selling income producing properties in Baltimore, Maryland. Our main focus is to offer investors turnkey and hassle-free properties with high returns.",
  "who-text-2": "As a subsidiary of International Realtors Group, our team has more than 15 years of experience in the US real estate market and has helped hundreds of international clients find their perfect real estate investment opportunities.",
  "mission": "MISSION",
  "mission-text": "Provide high yield return opportunities of the real estate market with integrity, honesty, and trust to investors from all parts of the world.",
  "vision": "VISION",
  "vision-text": "Enriching lives by offering financial freedom through real estate investments.",
  "our-team": "Our Team",
  "person-1": "Cengiz Bayirli",
  "title-1": "Founder & CEO",
  "summary-1": "Cengiz Bayirli, originally from Turkey, has an extensive international background. He graduated from Boston University with a degree in Business Administration, and his professional career began at the World Bank, where he developed skills as a great investor, and gained a global vision on business. After a few years, he decided to forge his own path, and began his career as an entrepreneur. His ability to sell together with this bargaining and closing power, led him to establish himself as a successful salesman and businessman internationally. After 20 years of experience as an international real estate agent, he decided to move to Miami full time in order to fully immerse himself in the American real estate market.",
  "person-2": "Giovanna Guzman",
  "title-2": "Co-Founder & Managing Partner",
  "summary-2": "Giovanna Guzman was born in Caracas, Venezuela, and educated in Caracas, Venezuela, Washington, D.C. and Boston, Massachusetts, where she graduated with a degree in Interior Design. Her unique interior design expertise and comprehensive knowledge of the South Florida real estate market has enabled Giovanna Guzman to fulfill her client’s wishes in all aspects of residential and commercial real estate. Above all, Giovanna Guzman is perhaps best known for her attention to detail and the professional, courteous and responsive service that has earned her a longstanding reputation as one of South Florida’s most successful real estate broker in the international market. Giovanna coach her agents that teamwork, honesty, and ethics is important for their success, get them to have full knowledge of Real Estate, provide them with the necessary sale tools so they can acquire confidence that will encourage them to have a profound relationship with their clients and help both client and agent complete a happy and successful transaction.",
  "person-3": "Ashley Alvarez",
  "title-3": "Operations Manager",
  "summary-3": "Ashley Alvarez was born and raised in the Dominican Republic and moved to New York at the age of 14 to complete her studies. She earned her Bachelor of Technology focused in Architectural Design & Building Technology from the State University Of New York at Delhi. In 2020, Ashley moved to Miami and joined International Realty Group as the Administrative Assistant. Her precision, professionalism, and ability to exceed expectations with projects and clients opened the opportunity for her to now serve as the Office Manager of Property Invest USA. Ashley consistently implements her skills and abilities in everything she does. Her experience in architectural design and real estate management has currently motivated her into helping and guiding investors to find the perfect investment opportunity in real estate. During her spare time, she enjoys dancing, music, traveling, cooking & spending time with family.",
  "person-4": "Keith Kaiser",
  "title-4": "Property Manager",
  "summary-4": "",
  "person-5": "David Garcia",
  "title-5": "Accounting Department",
  "summary-5": "",
  "int-offices": "International Offices",
  "turkey-office": "TURKEY OFFICE",
  "turkey-person-1": "Elif Tezcan",
  "turkey-title-1": "General Manager",
  "turkey-summary-1": "Elif Tezcan Bayirli is an attorney with a specialized expertise in legal consultancy services regarding international trade and commercial investments for over 20 years. She is also a licensed mediator registered with the Turkish Ministry of Justice. Her philosophy is focused on providing the clients with efficient, diligent, and timely work accompanied with a strong dedication in assisting the clients to reach their business goals. Her fluency in Turkish, English, and French languages enables her to collaborate on international projects worldwide. With such valuable professional skills, she facilitates the contract procedures for our clients and empowers them to make informed investment decisions. Giovanna coach her agents that teamwork, honesty, and ethics is important for their success, get them to have full knowledge of Real Estate, provide them with the necessary sale tools so they can acquire confidence that will encourage them to have a profound relationship with their clients and help both client and agent complete a happy and successful transaction.",
  "turkey-person-2": "Nilufer Ileri",
  "turkey-title-2": "Marketing Department",
  "turkey-summary-2": "Nilufer was born in Tekirdag, Turkey. She graduated from Anadolu University Faculty of Economics in 1995. She worked for many years as an editor and manager in the '1 Number Hearst' magazine group affiliated with the high circulation Sabah newspaper in 1999 and later in the Habertürk magazine group. She continued her education in the fields of business development and corporate communication. She worked for 2 years as a director at RMA, the consultancy company of the Ministry of Health, which she joined in 2013. Here, she worked with other stakeholder companies to prepare and implement projects for the Ministry of Health. During these duties, she improved herself by receiving training on special projects, corporate functioning, and executive training. She manage the media consultancy of many corporate companies since 2015",
  "dominic-office": "DOMINICAN REPUBLIC OFFICE",
  "dominic-person-1": "Gustavo Guzman",
  "dominic-title-1": "General Manager",
  "dominic-summary-1": "Venezuelan born in Caracas, insurance businessman with more than 48 years of experience in the insurance industry in Venezuela, founder and main shareholder of an insurance brokerage company, this company during its long history has been an intermediary for important insurance policies and projects, including banks, universities, private and public companies. Gustavo with his extensive experience at different levels in business management will be helping our clients to get the best investment.",
  "mexico-office": "MEXICO OFFICE",
  "mexico-person-1": "Luis Colmenter",
  "mexico-title-1": "Sales Director",
  "mexico-summary-1": "With extensive experience at different levels in business management in Latin America, Luis Fernando oversees IRG's business in MEX. Among his various responsibilities, he conducts the review and approval of new business and presentations related to projects in IRG's plan of operations. His 18 years of collective experience include real estate business regulation, management, sales, and marketing, with extensive management in all phases of the process, with special pre and post skills in maintaining contact with the client.",
  "mexico-person-2": "Eva Cardenas",
  "mexico-title-2": "Office Manager",
  "mexico-summary-2": "Eva was born in Venezuela, she is a lawyer with a history of more than 10 years in the field of registration and consulting for the sale of properties, which has allowed her to know about the regulations related to real estate transactions, with skills and necessary empathy to support their clients to understand the contracts at the moment of making the decision to acquire properties to suit them. Her dedication and persistence to work 24/7 makes the difference."
}
